classyapp/app/controllers/assignments_controller.rb

SELECT  "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
        @ass = Assignment.find(params[:id])
		@course = Course.find(params[:course_id])
		@school = School.find(params[:school_id])

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "assignments" ("course_id", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["course_id", 1], ["name", "a"], ["created_at", "2015-04-12 12:10:26.999383"], ["updated_at", "2015-04-12 12:10:26.999383"]]
---
	def create
		@school = School.find(params.require(:school_id) )
		@course = Course.find(params.require(:course_id) )
		@ass = Assignment.find_or_create_by(ass_params)