classyapp/app/controllers/courses_controller.rb

SELECT "assignments".* FROM "assignments" WHERE "assignments"."course_id" = ?  [["course_id", 1]]
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
        @ass = Assignment.where(course_id: params[:id])
		@course = Course.find(params[:id])
		@school = School.find(params[:school_id])