classyapp/app/controllers/schools_controller.rb

	def create
		@school = School.find_or_create_by(school_params)
		@course = Course.find_or_create_by(class_params)
---
INSERT INTO "schools" ("short", "city", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["short", "a"], ["city", "a"], ["created_at", "2015-04-12 12:10:21.760329"], ["updated_at", "2015-04-12 12:10:21.760329"]]
INSERT INTO "courses" ("school_id", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["school_id", 1], ["name", "a"], ["created_at", "2015-04-12 12:10:21.772566"], ["updated_at", "2015-04-12 12:10:21.772566"]]